<template>
  <div>
   <h1 style="margin-left: 260px;">Курс</h1>
    <v-container class="ml-0 mr-0" style="max-width:1350px">
      <v-layout row wrap>
        <v-flex xs2>
          <v-div flat>
            <v-timeline align-top dense>
              <v-timeline-item
                small
                light
                color="primary"
                v-for="item in block"
                :key="item"
              >
                <v-row class="pt-1">
                  <v-btn class="md" depressed color="primary">
                    {{ item.name }}
                  </v-btn>
                </v-row>
                <v-div v-if="item.childrens.length != 0">
                  <v-row
                    v-for="children in item.childrens"
                    class="ml-5 mt-5"
                    :key="children"
                  >
                    <v-btn
                      depressed
                      color="primary"
                      @click="html = children.html"
                    >
                      {{ children.name }}
                    </v-btn>
                  </v-row>
                </v-div>
              </v-timeline-item>
            </v-timeline>
          </v-div>
        </v-flex>
        <v-flex xs2></v-flex>
        <v-flex xs8 style="padding-left:65px">
          <quill-editor :content="html" style="background:white" />
          <!-- <v-card>
            <v-span rows=5
              background-color="#c9c9c9"
              class="px-0"
              v-html="html"
            ></v-span>
          </v-card> -->
        </v-flex>
      </v-layout>
    </v-container>
    <v-row no-gutters>
      <v-spacer></v-spacer>
      <v-btn class="mr-10" color="primary"> Далее</v-btn>
      <!-- <v-btn class="mr-10" color="primary">Итоговое тестирование </v-btn> -->
    </v-row>
  </div>
</template>

<script>
import "quill/dist/quill.core.css";
import "quill/dist/quill.snow.css";
import "quill/dist/quill.bubble.css";
import { quillEditor } from "vue-quill-editor";

export default {
  components: { quillEditor },
  data: () => ({
    html: ``,
    block: [
      {
        name: "Арготроник",
        childrens: [
          {
            id: 1,
            name: "Общее описание",
            html: `<h5>
                    Как это работает? </h5><p>
                      &nbsp;
                    </p><p>
                      Оператор заезжает в массив и направляет датчик рядков в междурядье и активирует систему автовождения.&nbsp;Чувствительный сенсор датчика, касается стеблей левого и правого рядов и передают сигнал в блок управления автовождением. Здесь сигнал обрабатывается и передается команда на мост управляющих колес, которая подсказывает, куда нужно повернуть: левее или правее, чтобы датчик сохранил центральное положение между рядами, по которым идет.
                    </p><p>
                      &nbsp;
                    </p><p>
                      Система управления траекторией движения агромашины на базе датчика рядка РСМ Агротроник Пилот 2.1 идеально подходит для операций по кормозаготовке и уборки пропашных культур.
                  </p>`,
          },
          {
            id: 2,
            name: "Функции контроля, учёта и анализа",
            html: `<h5>
                    Как это работает? </h5><p>
                      &nbsp;
                    </p><p>
                      Оператор заезжает в массив и направляет датчик рядков в междурядье и активирует систему автовождения.&nbsp;Чувствительный сенсор датчика, касается стеблей левого и правого рядов и передают сигнал в блок управления автовождением. Здесь сигнал обрабатывается и передается команда на мост управляющих колес, которая подсказывает, куда нужно повернуть: левее или правее, чтобы датчик сохранил центральное положение между рядами, по которым идет.
                    </p><p>
                      &nbsp;
                    </p><p>
                      Система управления траекторией движения агромашины на базе датчика рядка РСМ Агротроник Пилот 2.1 идеально подходит для операций по кормозаготовке и уборки пропашных культур.
                  </p>`,
          },
          {
            id: 3,
            name: "Задачи, решаемые системой",
            html: `<h5>
                    Как это работает? </h5><p>
                      &nbsp;
                    </p><p>
                      Оператор заезжает в массив и направляет датчик рядков в междурядье и активирует систему автовождения.&nbsp;Чувствительный сенсор датчика, касается стеблей левого и правого рядов и передают сигнал в блок управления автовождением. Здесь сигнал обрабатывается и передается команда на мост управляющих колес, которая подсказывает, куда нужно повернуть: левее или правее, чтобы датчик сохранил центральное положение между рядами, по которым идет.
                    </p><p>
                      &nbsp;
                    </p><p>
                      Система управления траекторией движения агромашины на базе датчика рядка РСМ Агротроник Пилот 2.1 идеально подходит для операций по кормозаготовке и уборки пропашных культур.
                  </p>`,
          },
          {
            id: 4,
            name: "Направления слежения",
            html: `<h5>
                    Как это работает? </h5><p>
                      &nbsp;
                    </p><p>
                      Оператор заезжает в массив и направляет датчик рядков в междурядье и активирует систему автовождения.&nbsp;Чувствительный сенсор датчика, касается стеблей левого и правого рядов и передают сигнал в блок управления автовождением. Здесь сигнал обрабатывается и передается команда на мост управляющих колес, которая подсказывает, куда нужно повернуть: левее или правее, чтобы датчик сохранил центральное положение между рядами, по которым идет.
                    </p><p>
                      &nbsp;
                    </p><p>
                      Система управления траекторией движения агромашины на базе датчика рядка РСМ Агротроник Пилот 2.1 идеально подходит для операций по кормозаготовке и уборки пропашных культур.
                  </p>`,
          },
          {
            id: 5,
            name: "Арготроник пилот 1.0",
            html: `<h2><span class="ql-size-large">Преимущества системы</span></h2><p><br></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Автоматическое управление траекторией движения с точностью до 2,2 см.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Автоматические развороты.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Поднятие/опускание жатки в конце и начале гона.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Автоматическое управление скоростью*.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Отправка карты-задания дистанционно через РСМ Роутер**.</span></p><p><br></p><h2><span class="ql-size-large">Типовой комплект оснащения</span></h2><p><br></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Приемник.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Базовая станция RTK.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Контроллер.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Насос-дозатор.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">● Пылевлагозащищенный дисплей.</span></p><p><br></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">Система увеличивает производительность и снижает трудоемкость полевых операций. Благодаря ей до 20 % снижается количество пропусков и перекрытий, экономится ГСМ, а работа в условиях плохой видимости и в темное время суток становится эффективнее.</span></p><h2><span style="color: rgb(16, 16, 16);" class="ql-size-large"><img src="https://rostselmash.com/upload/%D0%A1%D0%BB%D0%B0%D0%B9%D0%B4%D0%B5%D1%80_%D0%A0%D0%A1%D0%9C%20%D0%A3%D0%BC%D0%BD%D0%B0%D1%8F%20%D0%BC%D0%B5%D1%82%D0%BA%D0%B0_%D0%BA%D0%BE%D0%B1%D0%B0%D0%B9%D0%BD_svet.jpg"></span><span class="ql-size-large">Как это работает?</span></h2><p><br></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">Антенна принимает сигналы в одночастотном режиме от ГЛОНАСС и GPS. На дисплее отображается весь процесс автоуправления. С помощью дисплея также задаются рабочие параметры, имеется возможность загружать и выгружать необходимые диагностические данные (посредством USB, флеш-карт памяти, GSM-связи), настраивать и калибровать исполнительные механизмы. Способом повышения точности позиционирования является базовая станция RТК. Она обеспечивает высокую точность, непрерывно передавая сигналы коррекции с точностью до 2,2 см посредством радиоканалов.</span></p><p><br></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">Система увеличивает производительность до 30% и снижает трудоемкость полевых операций. Благодаря ей до 20 % снижается количество пропусков и перекрытий, экономится ГСМ, а работа в условиях плохой видимости и в темное время суток становится эффективнее.</span></p><p><br></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">* Доступно для машин, оснащённых опцией РСМ Адаптивный круиз-контроль.</span></p><p><span style="color: rgb(16, 16, 16);" class="ql-size-large">** Доступно для машин, оснащённых опцией РСМ Роутер.</span></p>`,
          },
          {
            id: 6,
            name: "Арготроник пилот 2.0",
            html: `<h5>
                    Как это работает? </h5><p>
                      &nbsp;
                    </p><p>
                      Оператор заезжает в массив и направляет датчик рядков в междурядье и активирует систему автовождения.&nbsp;Чувствительный сенсор датчика, касается стеблей левого и правого рядов и передают сигнал в блок управления автовождением. Здесь сигнал обрабатывается и передается команда на мост управляющих колес, которая подсказывает, куда нужно повернуть: левее или правее, чтобы датчик сохранил центральное положение между рядами, по которым идет.
                    </p><p>
                      &nbsp;
                    </p><p>
                      Система управления траекторией движения агромашины на базе датчика рядка РСМ Агротроник Пилот 2.1 идеально подходит для операций по кормозаготовке и уборки пропашных культур.
                  </p>`,
          },
          {
            id: 7,
            name: "Арготроник пилот 2.1",
            html: `<h5>
                    Как это работает? </h5><p>
                      &nbsp;
                    </p><p>
                      Оператор заезжает в массив и направляет датчик рядков в междурядье и активирует систему автовождения.&nbsp;Чувствительный сенсор датчика, касается стеблей левого и правого рядов и передают сигнал в блок управления автовождением. Здесь сигнал обрабатывается и передается команда на мост управляющих колес, которая подсказывает, куда нужно повернуть: левее или правее, чтобы датчик сохранил центральное положение между рядами, по которым идет.
                    </p><p>
                      &nbsp;
                    </p><p>
                      Система управления траекторией движения агромашины на базе датчика рядка РСМ Агротроник Пилот 2.1 идеально подходит для операций по кормозаготовке и уборки пропашных культур.
                  </p>`,
          },
        ],
      },
    ],
  }),
};
</script>

<style lang="scss">
.quill-editor > .ql-toolbar {
  display: none !important;
}
</style>
